var i = 0;

var statements = ["يديعوت أحرونوت: انقطاع التيار الكهربائي عن أحياء في مدينة صفد وبلدة بيريا في الجليل الأعلى جراء هجوم صاروخي من لبنان", "الجبهة الداخلية في إسرائيل: إطلاق صفارات الإنذار في الجليل الأعلى شمالي البلاد"
    , "الجيش الإسرائيلي: نحو 20 قذيفة عبرت من لبنان باتجاه إسرائيل تم اعتراض معظمها وسقط بعضها في مناطق مفتوحة", "يديعوت أحرونوت: اندلاع حرائق كبيرة في غابة بيريا شمالي البلاد جراء هجوم صاروخي من لبنان"];

var slideshow = function() {
  document.querySelector(".statement").textContent = statements[i];

  if (i < statements.length - 1) {
    i++;
  } else {
    i = 0;
  }

  setTimeout("slideshow()", 3000);
};

slideshow();